Source/Catalogs/Нейро_Массивы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>Нейро_Массивы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСписка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Нейро_ТипыСписков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЭлементыСписка</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Нейро_Типы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Нейро_VarianceScaling_Режим</v8:Type>
								<v8:Type>cfg:EnumRef.Нейро_Оптимизаторы</v8:Type>
								<v8:Type>cfg:EnumRef.Нейро_Ограничители</v8:Type>
								<v8:Type>cfg:EnumRef.Нейро_Метрики</v8:Type>
								<v8:Type>cfg:CatalogRef.Нейро_Массивы</v8:Type>
								<v8:Type>cfg:EnumRef.Нейро_Padding</v8:Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>cfg:EnumRef.Нейро_VarianceScaling_Распределение</v8:Type>
								<v8:Type>cfg:EnumRef.Нейро_ФункцииПотерь</v8:Type>
								<v8:Type>cfg:EnumRef.Нейро_Инициализаторы</v8:Type>
								<v8:Type>cfg:CatalogRef.Нейро_Функции</v8:Type>
								<v8:Type>cfg:EnumRef.Нейро_ПорядокКаналов</v8:Type>
								<v8:Type>cfg:EnumRef.Нейро_ФункцииАктивации</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>cfg:EnumRef.Нейро_Регуляризаторы</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:Type>cfg:EnumRef.Нейро_Upscaling</v8:Type>
								<v8:Type>cfg:EnumRef.Нейро_ТипыNumPy</v8:Type>
								<v8:Type>cfg:EnumRef.Нейро_ТипыСлоев</v8:Type>
								<v8:Type>cfg:EnumRef.Нейро_PaddingS</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Source/Enums/Нейро_ТипыСписков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>Нейро_ТипыСписков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Список</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кортеж</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Словарь</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Source/Enums/Нейро_Типы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>Нейро_Типы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Строка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Целое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вещественное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФункцияАктивации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Булево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инициализатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регуляризатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ограничитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Массив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПорядокКаналов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VarianceScaling_Режим</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>VarianceScaling_Распределение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипNumPy</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Функция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФункцияПотерь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Метрика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оптимизатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тензор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неопределено</Name>
					<Comment>None</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заполнение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнениеСокр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Апскейлинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слой</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Source/Catalogs/Нейро_Массивы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТипСпискаПриИзменении(Элемент)
	СформироватьНаименование();
	УстановитьВидимостьКлюча();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьКлюча()
	Если Объект.ТипСписка=ПредопределенноеЗначение("Перечисление.Нейро_ТипыСписков.Словарь") Тогда
		Элементы.ЭлементыКлюч.Видимость = Истина;
	Иначе
		Элементы.ЭлементыКлюч.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ Параметры.Ключ.Пустая() Тогда
		УстановитьВидимостьКлюча()
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПолучитьОписаниеТипа(Тип)
	Возврат Нейро_ОбщийМодуль.ПолучитьОписаниеТипаИзПеречисления(Тип);
КонецФункции

&НаКлиенте
Процедура ЭлементыТипПриИзменении(Элемент)
	ОписаниеТипа = ПолучитьОписаниеТипа(Элементы.ЭлементыСписка.ТекущиеДанные.Тип);
	Если ОписаниеТипа<>Неопределено Тогда
		Элементы.ЭлементыСписка.ТекущиеДанные.Значение = ОписаниеТипа.ПривестиЗначение(Элементы.ЭлементыСписка.ТекущиеДанные.Значение);
		//Элементы.ЭлементыСписка.ТекущиеДанные.Значение.ВыбиратьТип = Ложь;
	Иначе
		Элементы.ЭлементыСписка.ТекущиеДанные.Значение = Неопределено
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименование()
	Скобки = ТекстЛитералаСкобок();
	Наименование="";
	Если Объект.ЭлементыСписка.Количество()=0 Тогда 
		Объект.Наименование=Наименование;
		Возврат 
	КонецЕсли;
	Наименование=Скобки.Левая;
	Для Каждого Элемент Из Объект.ЭлементыСписка Цикл
		Если Элемент.Тип = ПредопределенноеЗначение("Перечисление.Нейро_Типы.Неопределено") Тогда
			Наименование = Наименование + "None";
		ИначеЕсли Объект.ТипСписка = ПредопределенноеЗначение("Перечисление.Нейро_ТипыСписков.Словарь") Тогда
			Наименование = Наименование + "'" +Элемент.Ключ+ "': " + СокрЛП(Элемент.Значение);
		Иначе
			Наименование = Наименование + СокрЛП(Элемент.Значение);
		КонецЕсли;
		Наименование = Наименование + ", ";
	КонецЦикла;
	Наименование=СокрП(Наименование);
	Если Прав(Наименование,1)="," Тогда
		Наименование=Лев(Наименование,СтрДлина(Наименование)-1);
	КонецЕсли;
	Наименование=Наименование+Скобки.Правая;
	Объект.Наименование=Наименование;
КонецПроцедуры

&НаКлиенте
Функция ТекстЛитералаСкобок()
	Если Объект.ТипСписка=ПредопределенноеЗначение("Перечисление.Нейро_ТипыСписков.Список") Тогда
		Возврат Новый Структура("Левая, Правая", "[", "]");
	ИначеЕсли Объект.ТипСписка=ПредопределенноеЗначение("Перечисление.Нейро_ТипыСписков.Кортеж") Тогда
		Возврат Новый Структура("Левая, Правая", "(", ")");
	ИначеЕсли Объект.ТипСписка=ПредопределенноеЗначение("Перечисление.Нейро_ТипыСписков.Словарь") Тогда
		Возврат Новый Структура("Левая, Правая", "{", "}");
	Иначе
		Возврат Новый Структура("Левая, Правая", "", "");
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ЭлементыСпискаПриИзменении(Элемент)
	СформироватьНаименование()
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыСпискаПослеУдаления(Элемент)
	СформироватьНаименование()
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыСпискаПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	Если ОтменаРедактирования Тогда
		ПодключитьОбработчикОжидания("СформироватьНаименование", 1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭлементыСпискаПриАктивизацииЯчейки(Элемент)
	Если Элемент.ТекущиеДанные=Неопределено Тогда Возврат КонецЕсли;
	Если Элемент.ТекущийЭлемент.Имя="ЭлементыЗначение" Тогда
		ОписаниеТипа = Нейро_ОбщийМодуль.ПолучитьОписаниеТипаИзПеречисления(Элемент.ТекущиеДанные.Тип);
		Если ОписаниеТипа<>Неопределено Тогда
			Элемент.ТекущийЭлемент.ОграничениеТипа = ОписаниеТипа;
		Иначе
			Элемент.ТекущийЭлемент.ОграничениеТипа = Новый ОписаниеТипов();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
